Repository: nguyenhk0733/IOS-Project-1
Catalog: ios/OnDeviceInferenceApp/Sources/Shared/Resources/*.lproj/Localizable.strings
Languages: vi

# tab_onboarding
source: Onboarding
vi: Hướng dẫn

# tab_capture
source: Capture
vi: Chụp ảnh

# tab_result
source: Result
vi: Kết quả

# tab_history
source: History
vi: Lịch sử

# tab_settings
source: Settings
vi: Cài đặt

# onboarding_title
source: OnDevice Inference
vi: Suy luận trên thiết bị

# onboarding_description
source: Get set up to run models on your device with privacy-first permissions.
vi: Thiết lập chạy mô hình ngay trên thiết bị với quyền riêng tư được ưu tiên.

# onboarding_next
source: Next
vi: Tiếp tục

# onboarding_start
source: Start
vi: Bắt đầu

# onboarding_page_welcome_title
source: Welcome
vi: Chào mừng

# onboarding_page_welcome_subtitle
source: Run models entirely on-device.
vi: Chạy mô hình hoàn toàn trên thiết bị.

# onboarding_page_capture_title
source: Capture
vi: Thu nhận

# onboarding_page_capture_subtitle
source: Collect input safely and privately.
vi: Thu thập dữ liệu an toàn và riêng tư.

# onboarding_page_results_title
source: Results
vi: Kết quả

# onboarding_page_results_subtitle
source: Review inference output instantly.
vi: Xem kết quả suy luận ngay lập tức.

# capture_description
source: Capture input to run on-device inference.
vi: Chụp hoặc chọn ảnh để chạy suy luận trên thiết bị.

source: Preparing model…
vi: Đang chuẩn bị mô hình…

# prepare_model_button
source: Prepare Model
vi: Chuẩn bị mô hình

# data_ready_label
source: Data ready for inference
vi: Dữ liệu đã sẵn sàng suy luận

source: Running inference…
vi: Đang chạy suy luận…

# run_inference_button
source: Run On-Device Inference
vi: Chạy suy luận trên thiết bị

# prediction_format
source: Prediction: %@
vi: Dự đoán: %@

# confidence_format
source: Confidence: %d%%
vi: Độ tin cậy: %d%%

source: View disease details
vi: Xem chi tiết bệnh

source: Share result
vi: Chia sẻ kết quả

# capture_navigation_title
source: Capture
vi: Chụp ảnh

source: Take Photo
vi: Chụp ảnh

source: Choose from Library
vi: Chọn từ thư viện

# last_capture_saved_format
source: Last capture saved to: %@
vi: Ảnh gần nhất đã lưu: %@

source: Mock Capture Input
vi: Giả lập dữ liệu

# share_summary_format
source: Label: %@ | Confidence: %d%%
vi: Nhãn: %@ | Độ tin cậy: %d%%

# no_capture_available
source: No captured image available for inference
vi: Chưa có ảnh nào để suy luận

# permission_camera_title
source: Camera Access
vi: Quyền truy cập camera

# permission_photo_title
source: Photo Library Access
vi: Quyền truy cập thư viện

# permission_camera_rationale
source: We use your camera to capture images for running on-device inference.
vi: Chúng tôi dùng camera để chụp ảnh phục vụ suy luận trên thiết bị.

# permission_photo_rationale
source: We access your photo library so you can select images for analysis.
vi: Chúng tôi cần thư viện ảnh để bạn chọn ảnh phân tích.

# allow_action
source: Allow
vi: Cho phép

# continue_action
source: Continue
vi: Tiếp tục

# open_settings_action
source: Open Settings
vi: Mở Cài đặt

# enable_access_reminder
source: Enable access in Settings to continue using this feature.
vi: Bật quyền trong Cài đặt để tiếp tục dùng tính năng này.

# status_access_granted
source: Access granted
vi: Đã cho phép

# status_access_denied
source: Access denied
vi: Bị từ chối

# status_access_restricted
source: Access restricted
vi: Bị hạn chế

# status_not_requested
source: Not requested yet
vi: Chưa yêu cầu

# result_description
source: Run inference on captured data and inspect results.
vi: Chạy suy luận trên dữ liệu đã chụp và xem kết quả.

source: Run Mock Inference
vi: Chạy suy luận thử

# summary_format
source: Summary: %@
vi: Tóm tắt: %@

# inference_time_format
source: Inference time: %.1f ms
vi: Thời gian suy luận: %.1f ms

# metadata_format
source: Metadata: %@
vi: Siêu dữ liệu: %@

# result_navigation_title
source: Result
vi: Kết quả

# favorites_section
source: Favorites
vi: Yêu thích

# recent_section
source: Recent
vi: Gần đây

source: No history yet
vi: Chưa có lịch sử

# history_error_title
source: History Error
vi: Lỗi lịch sử

# ok_action
source: OK
vi: Đồng ý

# history_navigation_title
source: History
vi: Lịch sử

# favorite_action
source: Favorite
vi: Yêu thích

# unfavorite_action
source: Unfavorite
vi: Bỏ yêu thích

# model_management_section
source: Model management
vi: Quản lý mô hình

source: Bundled model
vi: Mô hình kèm ứng dụng

source: Remote update placeholder
vi: Cập nhật từ xa (đang chờ)

# preferences_section
source: Preferences
vi: Tùy chọn

source: Enable telemetry
vi: Bật thu thập số liệu

source: Auto-save history
vi: Tự động lưu lịch sử

source: Compute unit
vi: Phần cứng suy luận

# feedback_privacy_section
source: Feedback & privacy
vi: Phản hồi & quyền riêng tư

source: Enable haptics
vi: Bật phản hồi xúc giác

source: Privacy mode
vi: Chế độ riêng tư

# privacy_mode_help
source: When enabled, captures and metadata stay on device.
vi: Khi bật, ảnh và siêu dữ liệu chỉ lưu trên thiết bị.

# language_section
source: Language
vi: Ngôn ngữ

source: App language
vi: Ngôn ngữ ứng dụng

# preference_display_section
source: Preference display
vi: Hiển thị tuỳ chọn

source: Name formatting
vi: Định dạng tên

# benchmark_section
source: Benchmark
vi: Đánh giá

# run_benchmark
source: Run on-device benchmark
vi: Chạy benchmark trên thiết bị

source: Samples
vi: Mẫu

# settings_navigation_title
source: Settings
vi: Cài đặt

# compute_auto
source: Auto
vi: Tự động

# language_system
source: System
vi: Theo hệ thống

# language_english
source: English
vi: Tiếng Anh

# formatting_original
source: Original
vi: Giữ nguyên

# formatting_uppercase
source: Uppercase
vi: CHỮ HOA

# formatting_titlecase
source: Title Case
vi: Viết Hoa Từng Từ

# top_user_radiologist
source: Radiologist
vi: Bác sĩ chẩn đoán hình ảnh

# top_user_radiologist_capability
source: Reviews scans with high accuracy
vi: Đánh giá phim với độ chính xác cao

# top_user_clinician
source: Clinician
vi: Bác sĩ lâm sàng

# top_user_clinician_capability
source: Quickly triages bedside captures
vi: Ưu tiên nhanh các ca tại giường

# top_user_researcher
source: Researcher
vi: Nhà nghiên cứu

# top_user_researcher_capability
source: Explores edge cases and anomalies
vi: Khám phá các trường hợp ngoại lệ

source: Inference service unavailable
vi: Dịch vụ suy luận không khả dụng

source: No benchmark yet
vi: Chưa có benchmark

# stability_stable
source: Stable
vi: Ổn định

# stability_warming
source: Warming up
vi: Đang khởi động

# benchmark_full_format
source: Avg %.1f ms · Last %.1f ms · %@
vi: TB %.1f ms · Lần gần nhất %.1f ms · %@

# benchmark_partial_format
source: Avg %.1f ms · %@
vi: TB %.1f ms · %@

# model_not_found
source: Compiled CoreML model not found in bundle.
vi: Không tìm thấy mô hình CoreML trong gói.

# model_not_prepared
source: Model not prepared. Call prepareModel() before running inference.
vi: Mô hình chưa sẵn sàng. Hãy gọi prepareModel() trước khi suy luận.

# preprocessing_failed_format
source: Preprocessing failed: %@
vi: Tiền xử lý thất bại: %@

# inference_failed_format
source: Inference failed: %@
vi: Suy luận thất bại: %@

source: Unexpected model output
vi: Kết quả mô hình không như kỳ vọng

# focus_failed_format
source: Unable to focus: %@
vi: Không thể lấy nét: %@

# back_camera_unavailable
source: Back camera is unavailable
vi: Không có camera sau

source: Cannot add camera input
vi: Không thêm được nguồn camera

# camera_configuration_failed_format
source: Camera configuration failed: %@
vi: Cấu hình camera lỗi: %@

source: Cannot add photo output
vi: Không thêm được đầu ra ảnh

# capture_failed_format
source: Capture failed: %@
vi: Chụp ảnh thất bại: %@

# read_photo_failed
source: Unable to read captured photo data
vi: Không đọc được dữ liệu ảnh đã chụp

# saving_photo_failed_format
source: Saving photo failed: %@
vi: Lưu ảnh thất bại: %@

# decode_image_failed
source: Unable to decode image data
vi: Không giải mã được dữ liệu ảnh

# pixel_buffer_failed
source: Failed to create pixel buffer
vi: Không tạo được pixel buffer

# disease_details_title
source: Disease details
vi: Chi tiết bệnh

source: Detected Label
vi: Nhãn đã phát hiện

source: Symptoms
vi: Triệu chứng

source: Care Tips
vi: Hướng dẫn chăm sóc

source: Model confidence
vi: Độ tin cậy mô hình

# confidence_progress_format
source: %d%% sure of this label
vi: Chắc chắn %d%% về nhãn này
